shape-opt/data/OpenFOAM/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;
//startFrom       startTime;

startTime       0;

stopAt          endTime;

//endTime         500;
endTime         6000;

deltaT          0.5;

writeControl    timeStep;

//writeInterval   1000;
writeInterval   12000;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{





	#includeFunc internalCloud

	forceCoeffs
	{
		type forceCoeffs;
		
		functionObjectLibs ( "libforces.so" );

		outputControl timeStep;

		outputInterval 1;

		patches
		(
			aerofoil
		);

		pName p;

		UName U;

		rho rhoInf;

		log true;

		rhoInf 1;

		CofR ( 0 0 0 );

		liftDir (  0.0  0.0    0 );

		dragDir (  1.0  0.0    0 );

		pitchAxis ( 0 0 1 );

		magUInf 0.2e-4;

		lRef 0.5;

		Aref 0.05;
	}

	forces
	{
		type forces;
		
		functionObjectLibs ( "libforces.so" );

		outputControl timeStep;

		outputInterval 1;

		patches
		(
			aerofoil
		);

		pName p;

		UName U;

		rho rhoInf;

		log true;

		rhoInf 1;

		CofR ( 0 0 0 );

	}





}


// ************************************************************************* //
