shape-opt/data/OpenFOAM/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-12;
        relTol          0.1;
        smoother        GaussSeidel;
        //smoother        DICGaussSeidel; // 
        //smoother        DIC; // 
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        //Valid asymmetric matrix smoothers are :
        //
        //5
        //(
        //DILU
        //DILUGaussSeidel
        //GaussSeidel
        //nonBlockingGaussSeidel
        //symGaussSeidel
        //)
        //smoother        DILUGaussSeidel;
        nSweeps         2;
        tolerance       1e-12;
        relTol          0.1;
    }

    nuTilda
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-12;
        relTol          0.1;
    }
}

SIMPLE
{
    //nNonOrthogonalCorrectors 0;
    nNonOrthogonalCorrectors 3;
    pRefCell        0;
    pRefValue       0;
    //consistent      yes; // Liwei: this is the switch for SIMPLEC
    residualControl
    {
        p               1e-22;
        U               1e-22;
        nuTilda         1e-22;
    }
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        nuTilda         0.7;
    }
}


// ************************************************************************* //
