shape-opt/data/OpenFOAM/system/internalCloud
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields interpolated to a specified cloud of points.

\*---------------------------------------------------------------------------*/

fields (p U);
points
(
(-1.0 -1.0 0.05)
(-0.984251968503937 -1.0 0.05)
(-0.9685039370078741 -1.0 0.05)
(-0.952755905511811 -1.0 0.05)
(-0.937007874015748 -1.0 0.05)
(-0.9212598425196851 -1.0 0.05)
(-0.905511811023622 -1.0 0.05)
(-0.889763779527559 -1.0 0.05)
(-0.8740157480314961 -1.0 0.05)
(-0.8582677165354331 -1.0 0.05)
(-0.8425196850393701 -1.0 0.05)
(-0.8267716535433071 -1.0 0.05)
(-0.8110236220472441 -1.0 0.05)
(-0.7952755905511811 -1.0 0.05)
(-0.7795275590551181 -1.0 0.05)
(-0.7637795275590551 -1.0 0.05)
(-0.7480314960629921 -1.0 0.05)
(-0.7322834645669292 -1.0 0.05)
(-0.7165354330708662 -1.0 0.05)
(-0.7007874015748031 -1.0 0.05)
(-0.6850393700787402 -1.0 0.05)
(-0.6692913385826771 -1.0 0.05)
(-0.6535433070866141 -1.0 0.05)
(-0.6377952755905512 -1.0 0.05)
(-0.6220472440944882 -1.0 0.05)
(-0.6062992125984252 -1.0 0.05)
(-0.5905511811023623 -1.0 0.05)
(-0.5748031496062992 -1.0 0.05)
(-0.5590551181102362 -1.0 0.05)
(-0.5433070866141732 -1.0 0.05)
(-0.5275590551181102 -1.0 0.05)
(-0.5118110236220472 -1.0 0.05)
(-0.49606299212598426 -1.0 0.05)
(-0.4803149606299213 -1.0 0.05)
(-0.4645669291338582 -1.0 0.05)
(-0.44881889763779526 -1.0 0.05)
(-0.4330708661417323 -1.0 0.05)
(-0.4173228346456693 -1.0 0.05)
(-0.40157480314960625 -1.0 0.05)
(-0.3858267716535433 -1.0 0.05)
(-0.3700787401574803 -1.0 0.05)
(-0.35433070866141736 -1.0 0.05)
(-0.3385826771653543 -1.0 0.05)
(-0.3228346456692913 -1.0 0.05)
(-0.30708661417322836 -1.0 0.05)
(-0.2913385826771654 -1.0 0.05)
(-0.2755905511811023 -1.0 0.05)
(-0.25984251968503935 -1.0 0.05)
(-0.2440944881889764 -1.0 0.05)
(-0.22834645669291342 -1.0 0.05)
(-0.21259842519685035 -1.0 0.05)
(-0.19685039370078738 -1.0 0.05)
(-0.18110236220472442 -1.0 0.05)
(-0.16535433070866146 -1.0 0.05)
(-0.14960629921259838 -1.0 0.05)
(-0.13385826771653542 -1.0 0.05)
(-0.11811023622047245 -1.0 0.05)
(-0.10236220472440949 -1.0 0.05)
(-0.08661417322834641 -1.0 0.05)
(-0.07086614173228345 -1.0 0.05)
(-0.055118110236220486 -1.0 0.05)
(-0.03937007874015752 -1.0 0.05)
(-0.023622047244094446 -1.0 0.05)
(-0.007874015748031482 -1.0 0.05)
(0.007874015748031482 -1.0 0.05)
(0.023622047244094446 -1.0 0.05)
(0.03937007874015741 -1.0 0.05)
(0.055118110236220375 -1.0 0.05)
(0.07086614173228356 -1.0 0.05)
(0.08661417322834652 -1.0 0.05)
(0.10236220472440949 -1.0 0.05)
(0.11811023622047245 -1.0 0.05)
(0.13385826771653542 -1.0 0.05)
(0.14960629921259838 -1.0 0.05)
(0.16535433070866135 -1.0 0.05)
(0.1811023622047243 -1.0 0.05)
(0.1968503937007875 -1.0 0.05)
(0.21259842519685046 -1.0 0.05)
(0.22834645669291342 -1.0 0.05)
(0.2440944881889764 -1.0 0.05)
(0.25984251968503935 -1.0 0.05)
(0.2755905511811023 -1.0 0.05)
(0.2913385826771653 -1.0 0.05)
(0.30708661417322825 -1.0 0.05)
(0.32283464566929143 -1.0 0.05)
(0.3385826771653544 -1.0 0.05)
(0.35433070866141736 -1.0 0.05)
(0.3700787401574803 -1.0 0.05)
(0.3858267716535433 -1.0 0.05)
(0.40157480314960625 -1.0 0.05)
(0.4173228346456692 -1.0 0.05)
(0.4330708661417322 -1.0 0.05)
(0.44881889763779537 -1.0 0.05)
(0.46456692913385833 -1.0 0.05)
(0.4803149606299213 -1.0 0.05)
(0.49606299212598426 -1.0 0.05)
(0.5118110236220472 -1.0 0.05)
(0.5275590551181102 -1.0 0.05)
(0.5433070866141732 -1.0 0.05)
...
(1.0 1.0 0.05)

);

type            sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;
setFormat	raw;

executeControl  writeTime;
writeControl    writeTime;

sets
(
    cloud
    {
        type    cloud;
        axis    xyz;
        points  $points;
    }
);

// ************************************************************************* //
